app/controllers/users_controller.rb

  def index
    @users = User.by_karma.paginate(:page => params[:page], :per_page => 100)
---
SELECT "users".* FROM "users" ORDER BY total_karma_points DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"